tutorials/compressible/rhoPimpleFoam/RAS/angledDuct/system/decomposeParDict.example
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method      simple;

coeffs
{
    n       ( 2 2 2 );

    // Optional coordinate transformation for sorting
    transform
    {
        origin      (-0.15 0.15 0);
        rotation    axisAngle;
        // Or disabled
        //rotation    none;

        axis    (0 0 1);
        angle   44.5;
    }
}


// ************************************************************************* //
